const mongoose = require('mongoose'); // מייבא את ספריית Mongoose, שמאפשרת לנו להגדיר מודלים (Schemas) עבור הנתונים שלנו ולתקשר עם בסיס הנתונים MongoDB בצורה נוחה ופשוטה יותר. הספרייה מספקת כלים ליצירת חיבורים, הגדרת סכימות ומודלים, וביצוע פעולות CRUD על הנתונים בבסיס הנתונים MongoDB.

const connectDB = async () => { // פונקציה אסינכרונית שמטרתה להתחבר לבסיס הנתונים MongoDB. היא מנסה להתחבר באמצעות כתובת ה-Mongo URI שמוגדרת במשתני הסביבה (process.env.MONGO_URI) או, אם לא מוגדרת, לכתובת ברירת המחדל 'mongodb://localhost:27017/flightMonitor'. אם החיבור מצליח, היא מדפיסה הודעה לקונסול שמאשרת את החיבור. אם יש שגיאה במהלך ניסיון החיבור, היא תיתפס ותודפס הודעת שגיאה לקונסול, והשרת ייסגר באמצעות process.exit(1) כדי למנוע המשך עבודה ללא חיבור תקין לבסיס הנתונים.
  try {
    const mongoUri = process.env.MONGO_URI || 'mongodb://localhost:27017/flightMonitor'; // מגדיר את כתובת ה-Mongo URI להתחברות לבסיס הנתונים. הוא בודק אם יש משתנה סביבה בשם MONGO_URI, ואם כן הוא ישתמש בו, אחרת הוא יפנה לכתובת ברירת המחדל 'mongodb://localhost:27017/flightMonitor'. זה מאפשר גמישות בהגדרת כתובת בסיס הנתונים, כך שניתן לשנות אותה בקלות מבלי לשנות את הקוד, רק על ידי הגדרת משתנה סביבה מתאים.
    await mongoose.connect(mongoUri); 
    console.log("Connected to MongoDB"); // אם החיבור לבסיס הנתונים מצליח, הודעה זו תודפס לקונסול כדי לאשר שהחיבור התקיים בהצלחה. זה חשוב במיוחד לצורך בדיקות ופתרון בעיות, כדי לוודא שהשרת יכול לתקשר עם בסיס הנתונים כראוי.
  } catch (err) {
    console.error("MongoDB connection error:", err); // אם יש שגיאה במהלך ניסיון החיבור לבסיס הנתונים, היא תיתפס כאן והודעת שגיאה מפורטת תודפס לקונסול. זה חשוב לצורך פתרון בעיות, כדי להבין מה הסיבה לכישלון החיבור (למשל, כתובת שגויה, בסיס נתונים לא זמין, בעיות רשת וכו').
    process.exit(1); // אם יש שגיאה בחיבור לבסיס הנתונים, השרת ייסגר באמצעות process.exit(1) כדי למנוע המשך עבודה ללא חיבור תקין לבסיס הנתונים. זה חשוב כדי למנוע מצבים שבהם השרת פועל אך לא יכול לתקשר עם בסיס הנתונים, מה שעלול לגרום לבעיות חמורות בתפקוד התקין של השרת ובטיפול בבקשות.
  }
};

module.exports = connectDB; // מייצא את הפונקציה connectDB, כך שניתן יהיה לייבא אותה ולהשתמש בה בקובץ הראשי של השרת (server.js) כדי להתחבר לבסיס הנתונים לפני שהשרת מתחיל להאזין לבקשות. זה מאפשר לארגן את הקוד בצורה מודולרית ונקייה יותר, כאשר כל הפונקציות והלוגיקה הקשורות לחיבור לבסיס הנתונים נמצאות בקובץ נפרד שנקרא config/db.js.
